results/cpu-vs-latency5/memcached/10-2/nsl201.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2723908 ops,   89950 (avg:   90794) ops/sec, 3.39MB/sec (avg: 3.42MB/sec),  1.78 (avg:  1.76) msec latency

10        Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        8256.24          ---          ---      1.76700       611.99
Gets       82539.70      9133.10     73406.60      1.75800      2894.30
Totals     90795.94      9133.10     73406.60      1.75900      3506.29


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     77.18479
SET       2.000     88.40284
SET       3.000     97.06609
SET       4.000     99.97376
SET       5.000     99.99758
SET       6.000    100.00000
---
GET       0.091      0.00004
GET       0.093      0.00008
GET       0.094      0.00012
GET       0.096      0.00024
GET       0.097      0.00028
GET       0.098      0.00036
GET       0.100      0.00061
GET       0.110      0.00109
GET       0.120      0.00210
GET       0.130      0.00359
GET       0.140      0.00618
GET       0.150      0.00921
GET       0.160      0.01304
GET       0.170      0.01870
GET       0.180      0.02581
GET       0.190      0.03534
GET       0.200      0.04693
GET       0.210      0.05811
GET       0.220      0.06881
GET       0.230      0.07940
GET       0.240      0.09119
GET       0.250      0.10193
GET       0.260      0.11089
GET       0.270      0.11724
GET       0.280      0.12249
GET       0.290      0.12943
GET       0.300      0.13585
GET       0.310      0.14082
GET       0.320      0.14522
GET       0.330      0.15075
GET       0.340      0.15629
GET       0.350      0.16218
GET       0.360      0.16687
GET       0.370      0.17236
GET       0.380      0.17793
GET       0.390      0.18496
GET       0.400      0.19191
GET       0.410      0.19736
GET       0.420      0.20208
GET       0.430      0.20749
GET       0.440      0.21468
GET       0.450      0.21957
GET       0.460      0.22433
GET       0.470      0.22934
GET       0.480      0.23447
GET       0.490      0.24113
GET       0.500      0.24578
GET       0.510      0.25014
GET       0.520      0.25559
GET       0.530      0.25923
GET       0.540      0.26379
GET       0.550      0.26872
GET       0.560      0.27211
GET       0.570      0.27530
GET       0.580      0.27861
GET       0.590      0.28237
GET       0.600      0.28548
GET       0.610      0.28850
GET       0.620      0.29174
GET       0.630      0.29569
GET       0.640      0.29933
GET       0.650      0.30288
GET       0.660      0.30644
GET       0.670      0.31031
GET       0.680      0.31431
GET       0.690      0.31803
GET       0.700      0.32186
GET       0.710      0.32566
GET       0.720      0.32909
GET       0.730      0.33410
GET       0.740      0.33915
GET       0.750      0.34371
GET       0.760      0.34759
GET       0.770      0.35171
GET       0.780      0.35764
GET       0.790      0.36313
GET       0.800      0.36863
GET       0.810      0.37448
GET       0.820      0.38167
GET       0.830      0.38882
GET       0.840      0.39718
GET       0.850      0.40626
GET       0.860      0.41535
GET       0.870      0.42516
GET       0.880      0.43667
GET       0.890      0.44863
GET       0.900      0.46050
GET       0.910      0.47605
GET       0.920      0.49156
GET       0.930      0.50985
GET       0.940      0.53150
GET       0.950      0.55427
GET       0.960      0.57887
GET       0.970      0.60693
GET       0.980      0.64138
GET       0.990      0.67954
GET       1.000      1.09974
GET       1.100     16.30721
GET       1.200     50.47770
GET       1.300     53.73372
GET       1.400     54.35624
GET       1.500     54.50817
GET       1.600     54.72858
GET       1.700     56.80655
GET       1.800     66.70842
GET       1.900     75.82265
GET       2.000     77.68008
GET       2.100     78.02593
GET       2.200     78.68055
GET       2.300     83.73071
GET       2.400     87.48329
GET       2.500     88.19070
GET       2.600     88.33507
GET       2.700     88.37344
GET       2.800     88.39371
GET       2.900     88.40837
GET       3.000     88.42238
GET       3.100     88.43276
GET       3.200     88.44710
GET       3.300     88.47169
GET       3.400     88.52524
GET       3.500     88.82909
GET       3.600     90.49793
GET       3.700     93.37469
GET       3.800     95.86082
GET       3.900     97.75949
GET       4.000     98.84756
GET       4.100     99.41338
GET       4.200     99.70314
GET       4.300     99.85227
GET       4.400     99.93805
GET       4.500     99.97953
GET       4.600     99.98994
GET       4.700     99.99277
GET       4.800     99.99374
GET       4.900     99.99459
GET       5.000     99.99483
GET       5.100     99.99511
GET       5.200     99.99532
GET       5.300     99.99584
GET       5.400     99.99600
GET       5.500     99.99677
GET       5.600     99.99721
GET       5.700     99.99766
GET       5.800     99.99843
GET       5.900     99.99919
GET       6.000     99.99935
GET       6.300     99.99939
GET       6.700     99.99952
GET       6.800     99.99968
GET       6.900     99.99984
GET       8.700     99.99988
GET       8.800    100.00000